DockablePaneMsgHook.HookProc(System.IntPtr,System.Int32,System.IntPtr,System.IntPtr,System.Boolean@)
The hook delegate that gets called for each message on the hooked source.
We hook to handle any DockablePane specific messages as well as to hook
WM_GETDLGCODE properly to allow for input commands on the embedded controls.

DockablePaneMsgHook.#ctor(System.Windows.Interop.HwndSource)
Construct a hook for the given source and panelData